{
  "themes": [
    {
      "name": "Introduction",
      "courses": [
        {
          "title": "Ce qu’est Java",
          "content": "ipsum",
          "slides": [
            {
              "content": "<div style='text-align:justify'>Si tu es dans cette application c'est que tu veux apprendre à programmer et que tu as décidé de commencer par le Java, tu as bien fait de venir ici.</br>Bon alors je sais toi tu veux coder, mais tu ne vas pas y couper on va faire de la théorie. Ne commence pas à râler, si tu veux pouvoir faire des choses intéressantes, tu dois comprendre ce que tu fais et ça tu ne peux y arriver qu’en connaissant la théorie.</br></br><b>Alors un bref historique:</b></br><p style='padding-left:15px;'>La première version de Java est apparue le 23 Janvier 1996, elle est développée par Sun Microsystem. En 2009 Sun a été racheté par Oracle qui poursuivit le développement de Java pour aujourd’hui pouvoir proposer la version 8.</p></div>",
              "imagePath": "/images/java.png"
            },
            {
              "content": "<div style='text-align:justify'>Quels sont les OUI au profits de Java ?</br></br>Et bien tout d’abords Java est un langage très demandé en entreprise (comme vous pouvez voir sur l’image de gauche). Java est aussi un langage extrêmement portable qui peut être exécuté sous Windows, Linux ou Mac, sous réserve d’avoir installé l’environnement java. En effet pour exécuter une application Java il te faudra la <b>JVM</b> (Java Virtual Machine) installée sur ta machine mais nous y reviendrons plus tard.</br></br>L’autre avantage de Java c’est que tu peux faire n’importe quel type d’application. En effet, tu peux faire des applications Web, des applications bureau (lourde ou légère), et des applications mobiles.</div>",
              "imagePath": ""
            }
          ],
          "imagePath": "",
          "exercices": [
            {
              "title": "exo 1",
              "content": "Integer quis consequatapplications que tu utilises. En quelque sorte il s’agit d’un ordinateur dans ton ordinateur. Le deuxième est l’ensemble des bibliothèques dont Java a besoin pour pouvoir construire les applications que tuapplications que tu utilises. En quelque sorte il s’agit d’un ordinateur dans ton ordinateur. Le deuxième est l’ensemble des bibliothèques dont Java a besoin pour pouvoir construire les applications que tuapplications que tu utilises. En quelque sorte il s’agit d’un ordinateur dans ton ordinateur. Le deuxième est l’ensemble des bibliothèques dont Java a besoin pour pouvoir construire les applications que tuapplications que tu utilises. En quelque sorte il s’agit d’un ordinateur dans ton ordinateur. Le deuxième est l’ensemble des bibliothèques dont Java a besoin pour pouvoir construire les applications que tu dolor. Nam mollis fermentum eleifend. Donec et fringilla lectus. Ut sodales dui nec turpis ultricies sodales. Morbi at ipsum magna. Duis dui diam, vehicula at fermentum vitae, gravida vitae ex. Donec iaculis accumsan est in pharetra. Mauris bibendum in metus consequat pellentesque. Ut suscipit magna id leo vestibulum, ut vulputate nisl maximus. Fusce diam est, imperdiet ac risus nec, pellentesque pulvinar est. Etiam est lorem, faucibus a ante et, vehicula ultricies quam. Quisque quam augue, placerat sed lacinia quis, rutrum eu ligula.",
              "difficulty": 0,
              "mandatory":1,
              "sourceFiles":1
            },
            {
              "title": "exo 2",
              "content": "content exo 2",
              "difficulty": 0,
              "mandatory":1,
              "sourceFiles":0
            }
          ]
        },
        {
          "title": "L’environnement Java",
          "content": "contenu 2",
          "slides": [
            {
              "content": "<div>Afin de pouvoir développer et exécuter des applications Java il te faudra la JVM (Java Virtual Machine) ainsi que le JDK (Java Development Kit).</br></br><i style='color:light-grey'>Mais qu’est ce que ça peut bien être que ces trucs ?</i></br></br>C’est très simple, le premier est une machine virtuelle, un environnement particulier qui a pour rôle de faire fonctionner les applications Java, comme windows fait tourner les applications que tu utilises. En quelque sorte il s’agit d’un ordinateur dans ton ordinateur. Le deuxième est l’ensemble des bibliothèques dont Java a besoin pour pouvoir construire les applications que tu auras codé.</br></br>Si tu peux lire ces lignes c’est que tu as déjà installé la JVM il ne te manque que le JDK, je te laisse aller sur ce lien : <a>http://www.oracle.com/technetwork/java/javase/downloads/index.html</a>, télécharger la version avec Netbeans et suivre les instructions d’installation.</br></div>",
              "imagePath": "/images/java.png"
            }
          ],
          "imagePath": "/images/java.png",
          "exercices": [
            {
              "title": "exo 1",
              "content": "content exo 1",
              "difficulty": 0,
              "mandatory":1,
              "sourceFiles":1
            },
            {
              "title": "exo 2",
              "content": "content exo 2",
              "difficulty": 0,
              "mandatory":0,
              "sourceFiles":0
            }
          ]
        }
      ]
    },
    {
      "name": "L'UML",
      "courses": [
        {
          "title": "titre 1",
          "content": "contenu 1",
          "slides": [
            {
              "content": "Aliquam egestas et ligula quis elementum. Duis ultrices fringilla auctor. Cras sodales, libero elementum dictum consectetur, enim ante volutpat enim, nec tincidunt sem nisl vitae metus. Ut finibus facilisis augue, at mattis massa consectetur vel. Cras ut turpis consectetur, pellentesque ligula et, elementum tortor. Pellentesque elit quam, ullamcorper id mattis quis, fringilla vel orci. Fusce sit amet mattis lectus. Nunc nec velit volutpat nunc malesuada viverra eget a augue. Phasellus viverra odio nec mollis hendrerit. Vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia Curae; Aliquam maximus ornare diam, a commodo magna aliquet nec. Sed at nulla hendrerit, pulvinar leo commodo, efficitur ipsum. Nunc elit sapien, euismod et lorem eget, viverra imperdiet massa. Proin et urna et arcu sollicitudin laoreet in a mauris. Vestibulum cursus nunc id nibh rutrum, ut tempor ipsum eleifend.",
              "imagePath": ""
            }
          ],
          "imagePath": "",
          "exercices": [
            {
              "title": "exo 1",
              "content": "Integer quis consequat dolor. Nam mollis fermentum eleifend. Donec et fringilla lectus. Ut sodales dui nec turpis ultricies sodales. Morbi at ipsum magna. Duis dui diam, vehicula at fermentum vitae, gravida vitae ex. Donec iaculis accumsan est in pharetra. Mauris bibendum in metus consequat pellentesque. Ut suscipit magna id leo vestibulum, ut vulputate nisl maximus. Fusce diam est, imperdiet ac risus nec, pellentesque pulvinar est. Etiam est lorem, faucibus a ante et, vehicula ultricies quam. Quisque quam augue, placerat sed lacinia quis, rutrum eu ligula.",
              "difficulty": 0,
              "mandatory":1,
              "sourceFiles":1
            },
            {
              "title": "exo 2",
              "content": "content exo 2",
              "difficulty": 0,
              "mandatory":0,
              "sourceFiles":1
            }
          ]
        },
        {
          "title": "titre 2",
          "content": "contenu 2",
          "slides": [
            {
              "content": "Proin nec dui et erat accumsan scelerisque varius quis lorem. Suspendisse potenti. Sed in purus lacus. Quisque ut nibh quis neque iaculis commodo. Proin et pretium libero, sed aliquam mauris. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos himenaeos. Donec sed eleifend nunc. Cras vehicula libero in lacus egestas volutpat.",
              "imagePath": ""
            }
          ],
          "imagePath": "",
          "exercices": [
            {
              "title": "exo 1",
              "content": "content exo 1",
              "difficulty": 0,
              "mandatory":0,
              "sourceFiles":0
            },
            {
              "title": "exo 2",
              "content": "content exo 2",
              "difficulty": 0,
              "mandatory":0,
              "sourceFiles":0
            }
          ]
        }
      ]
    }
  ]
}