  {
  "themes": [
    {
      "name": "Introduction",
      "courses": [
        {
          "title": "Ce qu’est Java",
          "content": "ipsum",
          "slides": [
            {
              "content": "<div style='text-align:justify'>Si tu es dans cette application c'est que tu veux apprendre à programmer et que tu as décidé de commencer par le Java, tu as bien fait de venir ici.</br>Bon alors je sais toi tu veux coder, mais tu ne vas pas y couper on va faire de la théorie. Ne commence pas à râler, si tu veux pouvoir faire des choses intéressantes, tu dois comprendre ce que tu fais et ça tu ne peux y arriver qu’en connaissant la théorie.</br></br><b>Alors un bref historique:</b></br><p style='padding-left:15px;'>La première version de Java est apparue le 23 Janvier 1996, elle est développée par Sun Microsystem. En 2009 Sun a été racheté par Oracle qui poursuivit le développement de Java pour aujourd’hui pouvoir proposer la version 8.</p></div>",
              "imagePath": "/images/java.png"
            },
            {
              "content": "<div style='text-align:justify'>Quels sont les OUI au profits de Java ?</br></br>Et bien tout d’abords Java est un langage très demandé en entreprise (comme vous pouvez voir sur l’image de gauche). Java est aussi un langage extrêmement portable qui peut être exécuté sous Windows, Linux ou Mac, sous réserve d’avoir installé l’environnement java. En effet pour exécuter une application Java il te faudra la <b>JVM</b> (Java Virtual Machine) installée sur ta machine mais nous y reviendrons plus tard.</br></br>L’autre avantage de Java c’est que tu peux faire n’importe quel type d’application. En effet, tu peux faire des applications Web, des applications bureau (lourde ou légère), et des applications mobiles.</div>",
              "imagePath": ""
            }
          ],
          "imagePath": "",
          "exercices": [
            
          ]
        },
        {
          "title": "L’environnement Java",
          "content": "contenu 2",
          "slides": [
            {
              "content": "<div>Afin de pouvoir développer et exécuter des applications Java il te faudra la JVM (Java Virtual Machine) ainsi que le JDK (Java Development Kit).</br></br><i style='color:light-grey'>Mais qu’est ce que ça peut bien être que ces trucs ?</i></br></br>C’est très simple, le premier est une machine virtuelle, un environnement particulier qui a pour rôle de faire fonctionner les applications Java, comme windows fait tourner les applications que tu utilises. En quelque sorte il s’agit d’un ordinateur dans ton ordinateur. Le deuxième est l’ensemble des bibliothèques dont Java a besoin pour pouvoir construire les applications que tu auras codé.</br></br>Si tu peux lire ces lignes c’est que tu as déjà installé la JVM il ne te manque que le JDK, je te laisse aller sur ce lien : <a>http://www.oracle.com/technetwork/java/javase/downloads/index.html</a>, télécharger la version avec Netbeans et suivre les instructions d’installation.</br></div>",
              "imagePath": "/images/java.png"
            },
  {
              "content": "<div>Bien maintenant que tout est installé, je dois te parler d’une dernière chose dont tu auras besoin. Il s’agit d’un environnement de développement (ou IDE). Tu peux faire sans mais c’est vraiment plus pratique avec, il en existe plusieurs par exemple: Eclipse, IntelliJ ou encore Netbeans. Or il se trouve que tu as déjà installé Netbeans, ce n’est pas forcément le “meilleur” IDE (si on peut dire qu’il en existe un meilleur qu’un autre), mais il est plus simple d’utiliser que Eclipse et IntelliJ est trop gros pour le genre d’applications que tu voudras faire.</br></div>",
              "imagePath": "/images/java.png"
            }
          ],
          "imagePath": "/images/java.png",
          "exercices": [
            {
              "title": "Hello World",
              "content": "Voici ton premier programme ! Je te vois trembler derrière ton clavier. Prépare toi tu n’auras jamais de TP aussi marquant que celui-ci, aussi difficile que celui-ci. Prépare toi à faire un Hello World ! Le Hello World est le premier programme que toute personne commence à copier coller pour tester si son installation fonctionne. Dans cette application nous l’avons déjà fait pour toi. Ça va pas trop déçu ? Donc on va profiter de ce TP pour faire un tour de l’interface. À gauche tu peux voir un écran avec du code, c’est l’interface dans laquelle tu vas coder, tu peux aussi copier coller ce code pour tester ton installation. À droite tu peux voir un terminal, c’est ici que les sorties d’erreur etc vont pour te permettre de voir tes erreurs et les corriger. Entre les deux tu peux voir un symbole “play”, si tu appuie dessus cela va lancer la compilation et l'exécution du code. Vas y essayes ! Sous le terminal si tu fais une erreur, tu verra apparaître une fenêtre avec des indices qui vont t’aider à voir quoi corriger. Profite bien de cette fonctionnalité pour te familiariser avec les différents types d’erreurs car cette aide n’existe pas dans un IDE classique.",
              "difficulty": 0,
              "mandatory":1,
              "sourceFiles":1,
              "result":"Hello World !"
            }
            
          ]
        }
      ]
    },
    {
      "name": "Base de programmation",
      "courses": [
        {
          "title": "Les variables",
          "content": "contenu 1",
          "slides": [
            {
              "content": "<div>Prépares toi pour ta première notion de programmation qui est comme le titre l’indique <b>Les Variables</b>. Elles sont à la base de la programmation et tu vas passer ton temps à les manipuler, donc il est important que tu comprennes comment ça marche.</br></br> Donc une variable est une boîte, dans laquelle tu vas ranger des trucs. On peut distinguer deux caractéristiques d’une variable, son <b>Nom</b> et son <b>Type</b>.</br></br>Lorsque tu crées un variable on dit que tu la déclare, et lorsque tu déclare une variable tu l'écris comme ça:</br></br>Type Nom;</br></br>Une fois déclarée la tu peux lui affecter une valeur, c’est à dire ranger quelque chose dedans et ça tu l’écris comme ça:</br></br>Nom = truc;</br></div>",
              "imagePath": ""
            },
    {
              "content": "<div>Le nom d’une variable est ce qui permet de la distinguer d’une autre, il est aussi très important que ce nom ai un rapport avec ce que tu ranges dedans. Effectivement quand un petit programme tout vas bien si ta variable s’appelle “a” mais quand tu commence à avoir plus d’une centaine de variable ça devient nettement plus compliqué. Alors surtout n’hésites pas à mettre des nom un peu (pas trop) long qui veulent dire quelque chose.</br></br>Ah j’ai oublié de te parler des règles quand tu écris le nom d’une variable.</br><ul><li>Pas d’espace dans le nom sinon il ne sera pas reconnu</li><li>Pas de chiffre en premier caractère</li><li>En Java le format est la camelCase, donc une variable commence par une minuscule et chaque mot qui suit commence par une majuscule ex unPetitLapin</li></ul></div>",
              "imagePath": ""
            },
      {
              "content": "<div>Le type maintenant. C’est ce qui défini ce que tu peux mettre dans la boîte, et ça c’est très important, si tu as une variable de type pomme tu ne pourra jamais ranger une orange dedans. Il existe deux grandes catégorie de type, les types primitifs et les types complexes. Dans cette partie je vais te montrer que les types primitifs, les autres tu les verra plus tard dans la partie Objet.</br></br>Donc voici la liste des types primitifs :</br></br></br><b>int :</b>  Ce sont les valeurs dites entières, les nombres sans virgule.</br><b>double :</b> Ce sont les nombres à virgules.</br><b>float :</b> Ce sont aussi les nombres à virgules. Il existe une différence entre un double et un float, mais elle n’est pas très importante donc je te conseille de n’utiliser que les float pour commencer.</br><b>bool :</b> Ce sont des booléens, leur utilité sera détaillé dans la partie boucle et condition, mais en gros tu dois savoir qu’un booléen est une variable que ne peut valoir que Vrai ou Faux.</br><b>char :</b> Ce sont les les caractère, et pour être exact dans un char on peut mettre qu’un seul caractère.</br><b>String :</b> Ce sont les chaînes de caractères, et cette fois tu peux en mettre plusieurs.</br></div>",
              "imagePath": ""
            }
          ],
          "imagePath": "",
          "exercices": [
            {
              "title": "Variables",
              "content": "Il est temps de te familiariser avec les variables. Dans cet exercice tu vas devoir créer trois variables: un entier, un nombre à virgule, un booléen. Une fois que ce sera fait, tu devras les donner en paramètre à la fonction printRes qui s’occupera de les afficher. Pour les besoin de l’exercice, je veux que l’entier ai une valeur de 186, le nombre à virgule une valeur de 1367.458 et que le booléen soit à Vrai.Fait bien attention aux consignes, si tu ne les respecte pas l’exercice ne sera pas validé.",
              "difficulty": 0,
              "mandatory":1,
              "sourceFiles":1,
              "result":"Entier : 186 Booléen : true Nombre à virgule : 1367.458"
            }
          ]
        },
        {
          "title": "Les conditions et les boucles",
          "content": "contenu 2",
          "slides": [
            {
              "content": "<div>Les conditions sont un moyen de faire en sorte que ton programme ai des comportements différents en fonction de données. Ces conditions sont mises en place avec la structure:</br>&nbsp;si:</br></t>&nbsp;&nbsp;un truc à faire</br>&nbsp;sinon si:</br>&nbsp;&nbsp;un autre truc à faire</br>&nbsp;sinon:</br>&nbsp;&nbsp;le truc à faire par défaut </br></br>En programmation le si se dit <b>if</b> et le sinon <b>else</b>. Dans la structure, seul le si est obligatoire, tu peux ne pas mettre ni le sinon si ni le sinon ou tu peux aussi n’en mettre qu’un des deux.</div>",
              "imagePath": ""
            },
            {
              "content": "<div>Une condition est composée de deux termes qui vont être évalué entre eux à l’aide d’un opérateur, par exemple 1 = 1. Les opérateurs sont les suivant : </br></br><b>==</b> pour tester l’égalité entre les deux termes</br><b>!=</b> pour tester l’inégalité entre les deux termes</br><b><</b> strictement inférieur</br><b><=</b> inférieur ou égal</br><b>></b> strictement supérieur</br><b>>=</b> supérieur ou égal</br><b>&&</b> l’opérateur ET logique</br><b>||</b> l’opérateur OU logique</br></br>Comme tu peux le voir ce sont les opérateurs mathématiques classique à l'exception des deux derniers qui sont des opérateur logiques. Pour les comprendre plus en détail je te laisse aller voir ce site qui explique très bien ce que c’est :</br><u style='color: blue;'>http://www.elektronique.fr/cours/porte-logique/portes-de-base.php</u>.</br>Et pour t’expliquer rapidement, c’est un opérateur qui ne peut être effectué que sur des booléens et qui dit si les deux termes sont vrai pour l’opérateur ET et si l’un des deux est vrai pour l’opérateur ou.</div>",
              "imagePath": ""
            },
            {
              "content": "<div>Un if n’est capable d’évaluer qu’un booléen c’est pourquoi tous les opérateur renvoient un booléen.</br>Revenons à la structure <b>if/else</b>.</br></br>En Java ça s'écrit de cette manière :</br></br>&nbsp;&nbsp;if(condition){</br>&nbsp;&nbsp;&nbsp;&nbsp;truc à faire</br>&nbsp;&nbsp;}</br>&nbsp;&nbsp;else{</br>&nbsp;&nbsp;&nbsp;&nbsp;truc à faire</br>&nbsp;&nbsp;}</br></br></br>Il est bien sur possible de rajouter des <b>else if</b> au milieu ou de ne pas mettre de else. Dans l’idée ici, la condition du <b>if</b> va être évaluée et si elle renvois Vrai la partie de code sous le if va être exécutée et si elle renvois Faux ce sera celle sous le else.</br></br>Dans le cas où il y a des <b>else if</b>  si la condition du if renvois Faux, la condition du du if else suivant sera évaluée et ainsi de suite jusqu’au else (s’il y en a un).</div>",
              "imagePath": ""
            },
            {
              "content": "<div>Maintenant que les conditions n’ont plus de secret pour toi, je vais t’expliquer ce que sont les boucles. Souvent tu voudras faire un programme qui fait la même chose un grand nombre de fois, tu auras alors deux solutions, copier coller le bout de code ou faire une boucle. Tu vas être d’accord pour dire que c’est tout de même mieux d’utiliser une boucle, ça rend ton code plus court et plus facilement compréhensible.</br></br>Donc pour faire une boucle il y a 3 méthodes différentes, les boucles tant que (<b>while</b>), les boucles faire tant que (<b>do while</b>) et les boucles pour (<b>for</b>).</div>",
              "imagePath": ""
            },
            {
              "content": "<div>Les boucles <b>while</b>. C’est une boucle qui va effectuer une tâche tant qu’un certaine condition n’est pas atteinte, en Java elle s’écrit de la manière suivante :</br></br>&nbsp;while(condition){</br>&nbsp;&nbsp;truc à faire</br>&nbsp;}&nbsp;&nbsp;Il est important de noter que avec cette boucle si la condition de sortie est déjà remplie avant de rentrer dans la boucle elle sera ignorée. De même si la condition de sortie ne peut pas être atteinte, la boucle sera infinie et fera n’importe quoi.</div>",
              "imagePath": ""
            },
            {
              "content": "<div>Enfin les boucles <b>for</b>, ce sont des boucles avec un point de départ, une condition d’arrêt et un pas d’incrément. Elles sont souvent utilisées quand on sait à l’avance le nombre de tour de boucle (itération) on veut faire. Par exemple pour afficher les nombre de 1 à 10 la boucle for sera privilégiée aux autres. En Java elle se note comme ceci :</br></br>&nbsp;for(point de départ; condition; pas d’incrément){</br>&nbsp;&nbsp;truc à faire</br>&nbsp;}</div>",
              "imagePath": ""
            }
          ],
          "imagePath": "",
          "exercices": [
            {
              "title": "If...else",
              "content": "Dans cet exercice tu vas te familiariser avec les conditions. Si tu as bien lu en cours, tu as compris qu’une condition permet d’isoler certains morceaux de code pour qu’ils ne soient utilisés qu'à certaines conditions. Donc dans cet exercice tu as un morceau de code qui est isolé par un if et tu vas devoir trouver la bonne valeur pour qu’il soit exécuté.",
              "difficulty": 0,
              "mandatory":0,
              "sourceFiles":1,
              "result":"Chaine : Bravo !"
            },
            {
              "title": "Boucles",
              "content": "Maintenant que tu maîtrises les variables ainsi que les conditions, tu vas utiliser les boucles. Si tu te souviens bien ton cours, il y a deux piège lorsque tu fais une boucle, faire attention aux  boucles infinies et aux conditions de sorties. Donc l’exercice. Tu vas faire une boucle qui calcule la somme des entier de 1 à 10, puis qui en affiche le résultat. Mais je veux également que en cours de boucle, si la somme est paire tu affiches  Licorne et si elle est impaire tu affiches Lapin.Astuce : Pour vérifier si un nombre est paire ou non, on utilise l’opérateur modulo ou %. Cet opérateur va te retourner le reste d’une division euclidienne. Donc par exemple si tu fais 1%2 le résultat sera 1, si tu fais 2%2 le résultat sera de 0 et ainsi de suite.",
              "difficulty": 0,
              "mandatory":0,
              "sourceFiles":1,
              "result":"Chaine : Lapin Resultat : 55"
            },
            {
              "title": "Lapins",
              "content": "C’est bien joli tous ces exercices pour prendre en main les concepte mais il est temps que tu  fasses un exercice un peu plus compliqué. Enfin quand je dit compliqué, ça reste accessible à ton niveau hein. Voici le problème : \"Un homme met un couple de lapins dans un lieu isolé de tous les côtés par un mur. Combien de couples obtient-on en un an si chaque couple engendre tous les mois un nouveau couple à compter du troisième mois de son existence ?\" Dans ce problème les lapins ne peuvent pas mourrir, et un couple ne peut pas se reproduire le mois de sa naissance. Donc à un mois donné le nombre de couple de lapin est égal à la somme du nombre de couple des deux mois précédents. Ex: Au mois 3 il y 2 couples, au mois 4 il y en a 1 + 2 donc trois et ainsi de suite. Tu as toutes le clés en main pour pouvoir faire un programme (dans la fonction lapin) qui calcule le nombre cette suite. Pour l’exercice la solution finale attendue est le nombre de couple de lapin au 12ème mois, et je suis gentil donc je vais te donner le résultat que tu dois obtenir : 144.",
              "difficulty": 0,
              "mandatory":0,
              "sourceFiles":1,
              "result":"Fibonnacci de 12 : 144"
            }
          ]
        }
      ]
    }
  ]
}